app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE (name LIKE '%phy%' or author LIKE '%phy%' or isbn LIKE '%phy%' or price LIKE '%phy%' or category LIKE '%phy%' or status LIKE '%phy%')  ORDER BY name asc
---
	def index
		@books = Book.all.order("#{sort_column} #{sort_direction}")

INSERT INTO `books` (`name`, `author`, `isbn`, `category`, `price`, `published`, `created_at`, `updated_at`) VALUES ('Robotics', 'Marvel', 909090, 'Engine', 500, 1, '2018-08-01 17:52:02.329811', '2018-08-01 17:52:02.329811')
---
	def create
		@book = Book.new(book_params)
    	if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1
---
	def edit
		@book = Book.find_by_id(params[:id])

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1
UPDATE `books` SET `author` = 'metal123', `published` = 0, `updated_at` = '2018-08-02 06:55:01.176721' WHERE `books`.`id` = 8
---
	def update
		@book = Book.find_by_id(params[:id])
		if @book.update_attributes(book_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 4
---
	def destroy
		@book_details = Book.find_by_id(params[:id])
		@book_details.destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1
UPDATE `books` SET `published` = 1, `updated_at` = '2018-08-02 03:30:11.360538' WHERE `books`.`id` = 8
---
	def update_status
		@book = Book.find_by_id(params[:id])
		if @book.update_attribute("status",params[:status])